#Область ПрограммныйИнтерфейс

Процедура ТелеграмУведомление() Экспорт

	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , ,Новый ЗащищенноеСоединениеOpenSSL);

	ДанныеДляЗапроса = "bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапроса);

	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УведомлениеТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомлениеТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомлениеТелеграмБоту КАК ВКМ_УведомлениеТелеграмБоту";

	Выборка = Запрос.Выполнить().Выбрать();

	ИдентификаторГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

	Пока Выборка.Следующий() Цикл

		Сообщение = Новый Структура;
		Сообщение.Вставить("chat_id", ИдентификаторГруппыДляОповещения);
		Сообщение.Вставить("text", Выборка.ТекстСообщения);

		СтрокаJSON = СтрокаJSON(Сообщение);

		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);

		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);

		Если HTTPОтвет.КодСостояния = 200 Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Удалить();
		Иначе
			ИнформацияОбОшибке = ИнформацияОбОшибке();

			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокаJSON(ОбъектJSON)

	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);

	Возврат Запись.Закрыть();

КонецФункции

#КонецОбласти