#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСотрудников

&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.СписокСотрудников.ТекущиеДанные;

	ТекСтрока = СотрудникПремия(ТекущаяСтрока.Сотрудник);

	ТекущаяСтрока.СуммаПремии = ТекСтрока;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СотрудникПремия(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";

	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	Выборка = Запрос.Выполнить().Выбрать();

	ТекСтрока = 0;

	Если Выборка.Следующий() Тогда
		ТекСтрока = Выборка.Оклад - (Выборка.Оклад * Выборка.ПроцентОтРабот / 100);
	КонецЕсли;

	Возврат ТекСтрока;

КонецФункции

#КонецОбласти