#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();

	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	РАЗНОСТЬДАТ(ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот, ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот, ЧАС) КАК
	|		ПлановоеКоличествоЧасов,
	|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот КАК ВремяНачалаРабот,
	|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачалаДействия КАК ДоговорДатаНачала,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончанияДействия КАК ДоговорДатаОкончания,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ДоговорВидДоговора,
	|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы, 0) КАК СтоимостьЧасаПоДоговору,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	ПлановоеКоличествоЧасов = 0;

	Пока Выборка.Следующий() Цикл

		Если Выборка.ДоговорВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда

			Если ДатаПроведенияРабот < Выборка.ДоговорДатаНачала Или ДатаПроведенияРабот > Выборка.ДоговорДатаОкончания Тогда

				Сообщение = СтрШаблон("Выбранный документ не может быть проведен.
									  | Действие договора с %1 по %2.", Выборка.ДоговорДатаНачала,
					Выборка.ДоговорДатаОкончания);

				ОбщегоНазначения.СообщитьПользователю(Сообщение);
				Отказ = Истина;
			КонецЕсли;

		КонецЕсли;

		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.КоличествоЧасов = Выборка.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = Выборка.ФактическиПотраченоЧасов * Выборка.СтоимостьЧасаПоДоговору;
		ПлановоеКоличествоЧасов = Выборка.ПлановоеКоличествоЧасов;

	КонецЦикла;

	ДанныеСотрудникаОтРабот = ПолучитьДанныеСотрудникаОтРабот(Специалист);

	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.СуммаКОплате = ДанныеСотрудникаОтРабот.Оклад * ПлановоеКоличествоЧасов + (ДанныеСотрудникаОтРабот.Оклад
		* ПлановоеКоличествоЧасов * ДанныеСотрудникаОтРабот.ПроцентОтРабот / 100);
	Движение.ЧасовКОплате = ПлановоеКоличествоЧасов;

КонецПроцедуры
Процедура ПриЗаписи(Отказ)
	//++ ПриЗаписи
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СтарыеДанные = ПолучитьСтарыеЗначенияРеквизитов();

	Если СтарыеДанные.Дата <> Дата Или СтарыеДанные.ВремяНачалаРабот <> ВремяНачалаРабот
		Или СтарыеДанные.ВремяОкончанияРабот <> ВремяОкончанияРабот Или СтарыеДанные.Специалист <> Специалист Тогда
		СоздатьЗадачуВОчереди();
	Иначе
		СоздатьЗадачуВОчереди();
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Данные СотрудникаОтРабот возвращает Структуру содержащий: Оклад, ПроцентОтРабот
Функция ПолучитьДанныеСотрудникаОтРабот(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	Выборка = Запрос.Выполнить().Выбрать();

	ДанныеСотрудникаОтРабот = Новый Структура;
	ДанныеСотрудникаОтРабот.Вставить("Оклад", 0);
	ДанныеСотрудникаОтРабот.Вставить("ПроцентОтРабот", 0);

	Если Выборка.Следующий() Тогда
		ДанныеСотрудникаОтРабот.Вставить("Оклад", Выборка.Оклад);
		ДанныеСотрудникаОтРабот.Вставить("ПроцентОтРабот", Выборка.ПроцентОтРабот);
		Возврат ДанныеСотрудникаОтРабот;
	КонецЕсли;

	Если ДанныеСотрудникаОтРабот.Оклад = 0 Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не найден оклад сотрудника " + Сотрудник, ЭтотОбъект, "Сотрудник",
			"Объект", Отказ);
	КонецЕсли;

КонецФункции

Процедура СоздатьЗадачуВОчереди()

	ЗадачаОчереди = Справочники.ВКМ_ОчередьОтправки.СоздатьЭлемент();
	ЗадачаОчереди.Наименование = "Отправка уведомления";
	ЗадачаОчереди.ДокументСсылка = Ссылка;
	ЗадачаОчереди.ДатаСозданияЗадачи = ДатаПроведенияРабот;
	ЗадачаОчереди.Статус = ПредопределенноеЗначение("Перечисление.ВКМ_СтатусыОчереди.КОтправке");
	ЗадачаОчереди.Записать();

КонецПроцедуры

// Функция возвращает старые значения реквизитов документа
Функция ПолучитьСтарыеЗначенияРеквизитов()

	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Дата", Дата);
	СтруктураРеквизитов.Вставить("ВремяНачалаРабот", ВремяНачалаРабот);
	СтруктураРеквизитов.Вставить("ВремяОкончанияРабот", ВремяОкончанияРабот);
	СтруктураРеквизитов.Вставить("Специалист", Специалист);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|    Документ.Дата КАК Дата,
	|    Документ.ВремяНачалаРабот КАК ВремяНачалаРабот,
	|    Документ.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
	|    Документ.Специалист КАК Специалист
	|ИЗ
	|    Документ.ВКМ_ОбслуживаниеКлиента КАК Документ
	|ГДЕ
	|    Документ.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
	КонецЕсли;

	Возврат СтруктураРеквизитов;

КонецФункции

#КонецОбласти
#КонецЕсли