#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ПлановоеКолЧасов КАК ФактическиПотраченоЧасов,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	РАЗНОСТЬДАТ(ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот, ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот, ЧАС) КАК
	|		ПлановоеКоличествоЧасов,
	|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот КАК ВремяНачалаРабот,
	|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачалаДействия КАК ДоговорДатаНачала,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончанияДействия КАК ДоговорДатаОкончания,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ДоговорВидДоговора,
	|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы, 0) КАК СтоимостьЧасаПоДоговору,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если Выборка.ДоговорВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда

			Если ДатаПроведенияРабот < Выборка.ДоговорДатаНачала Или ДатаПроведенияРабот > Выборка.ДоговорДатаОкончания Тогда

				Сообщение = СтрШаблон("Выбранный документ не может быть проведен.
									  | Действие договора с %1 по %2.", Выборка.ДоговорДатаНачала,
					Выборка.ДоговорДатаОкончания);

				ОбщегоНазначения.СообщитьПользователю(Сообщение);
				Отказ = Истина;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	ДанныеСотрудникаОтРабот = ПолучитьДанныеСотрудникаОтРабот(Специалист);

	// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Если ДанныеСотрудникаОтРабот <> Неопределено Тогда
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	ПроцентОтРаботы = ?(ДанныеСотрудникаОтРабот.ПроцентОтРабот = 0, 1, ДанныеСотрудникаОтРабот.ПроцентОтРабот);
	Движение.ЧасовКОплате = Выборка.ФактическиПотраченоЧасов;
	Движение.СуммаКОплате = Выборка.ФактическиПотраченоЧасов * Выборка.СтоимостьЧасаПоДоговору * ПроцентОтРаботы / 100;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Данные СотрудникаОтРабот возвращает Структуру содержащий: Оклад, ПроцентОтРабот
Функция ПолучитьДанныеСотрудникаОтРабот(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПервых.Период КАК Период,
	|	ВКМ_УсловияОплатыСотрудниковСрезПервых.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПервых.Оклад КАК Оклад,
	|	ВКМ_УсловияОплатыСотрудниковСрезПервых.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПервых(, Сотрудник = &Сотрудник) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПервых";

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	Выборка = Запрос.Выполнить().Выбрать();

	ДанныеСотрудникаОтРабот = Новый Структура;
	ДанныеСотрудникаОтРабот.Вставить("Оклад", 0);
	ДанныеСотрудникаОтРабот.Вставить("ПроцентОтРабот", 0);

	Если Выборка.Следующий() Тогда
		ДанныеСотрудникаОтРабот.Вставить("Оклад", Выборка.Оклад);
		ДанныеСотрудникаОтРабот.Вставить("ПроцентОтРабот", Выборка.ПроцентОтРабот);
		Возврат ДанныеСотрудникаОтРабот;
	КонецЕсли;
	
		Возврат ДанныеСотрудникаОтРабот;

КонецФункции

#КонецОбласти
#КонецЕсли