// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ЗаполнитьФормуДанными();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;

	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;

	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)

	РассчитатьСуммуДокумента();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;

	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;

	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)

	РассчитатьСуммуДокумента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)

	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;

	РассчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()

	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");

КонецПроцедуры
#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//++
&НаСервере
Процедура ВыполненныеКлиентуРаботы()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_Док
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстатки.КоличествоЧасовОстаток, 0) КАК КоличествоЧасовОстаток,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстатки.СуммаКОплатеОстаток, 0) КАК СуммаКОплатеОстаток,
	|	ВТ_Док.Договор КАК Договор,
	|	ВТ_Док.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Остатки(&Период, (Договор, Клиент) В
	|		(ВЫБРАТЬ
	|			ВТ_Док.Договор КАК Договор,
	|			ВТ_Док.Контрагент КАК Контрагент
	|		ИЗ
	|			ВТ_Док КАК ВТ_Док)) КАК ВКМ_ВыполненныеКлиентуРаботыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Док КАК ВТ_Док
	|		ПО ВТ_Док.Договор.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОстатки.Договор.Ссылка
	|		И ВТ_Док.Контрагент.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОстатки.Клиент.Ссылка
	|ГДЕ
	|	ВКМ_ВыполненныеКлиентуРаботыОстатки.КоличествоЧасовОстаток <> 0
	|	И ВКМ_ВыполненныеКлиентуРаботыОстатки.СуммаКОплатеОстаток <> 0";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", Объект.Дата);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Товар = Объект.Товары.Добавить();
		Товар.Номенклатура = Справочники.Номенклатура.ВыполненныеКлиентуРаботы;
		Товар.Количество = Выборка.КоличествоЧасовОстаток;
		Товар.Цена = Выборка.СуммаКОплатеОстаток;
		Товар.Сумма = Выборка.СуммаКОплатеОстаток * Выборка.СуммаКОплатеОстаток;
		
		Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьАвтозаполнение(ДоговорАбоненскоеОбслуживание)

	Если ЗначениеЗаполнено(Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить()) И ЗначениеЗаполнено(
		Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить()) Тогда
		Объект.Товары.Очистить();
		Объект.Услуги.Очистить();

		Товар = Объект.Товары.Добавить();
		Товар.Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		Товар.Количество = 1;
		Товар.Цена = ДоговорАбоненскоеОбслуживание.СуммыАбонентскойПлаты;
		Товар.Сумма = ДоговорАбоненскоеОбслуживание.СуммыАбонентскойПлаты;

		Услуга = Объект.Услуги.Добавить();
		Услуга.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		Услуга.Количество = 1;
		Услуга.Цена = ДоговорАбоненскоеОбслуживание.СтоимостьЧасаРаботы;
		Услуга.Сумма = ДоговорАбоненскоеОбслуживание.СтоимостьЧасаРаботы;

		Объект.СуммаДокумента = Товар.Сумма + Услуга.Сумма;

		ВыполненныеКлиентуРаботы();

	Иначе
		ОбщегоНазначения.СообщитьПользователю("Проверти данные для заполнения.");

		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВМК_Заполнить(Команда)

	ДоговорАбоненскоеОбслуживание = ВидДоговораАбоненскоеОбслуживание();

	Если ДоговорАбоненскоеОбслуживание.ВидДоговораАбоненскоеОбслуживание Тогда
		ВыполнитьАвтозаполнение(ДоговорАбоненскоеОбслуживание);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВидДоговораАбоненскоеОбслуживание()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА
	|			РеализацияТоваровУслуг.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВидДоговораАбоненскоеОбслуживание,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Договор.ВКМ_СуммыАбонентскойПлаты, 0) КАК СуммыАбонентскойПлаты,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Договор.ВКМ_СтоимостьЧасаРаботы, 0) КАК СтоимостьЧасаРаботы,
	|	РеализацияТоваровУслуг.Договор.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ДоговорАбоненскоеОбслуживание = Новый Структура;

	Если Выборка.Следующий() Тогда
		ДоговорАбоненскоеОбслуживание.Вставить("ВидДоговораАбоненскоеОбслуживание",
			Выборка.ВидДоговораАбоненскоеОбслуживание);
		ДоговорАбоненскоеОбслуживание.Вставить("СуммыАбонентскойПлаты", Выборка.СуммыАбонентскойПлаты);
		ДоговорАбоненскоеОбслуживание.Вставить("СтоимостьЧасаРаботы", Выборка.СтоимостьЧасаРаботы);
		ДоговорАбоненскоеОбслуживание.Вставить("ВидДоговора", Выборка.ВидДоговора);
		Возврат ДоговорАбоненскоеОбслуживание;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

&НаСервере
Процедура ЗаполнитьФормуДанными()
	КомандаЗаполнить = Элементы.Добавить("КомандаЗаполнить", Тип("КнопкаФормы"), КоманднаяПанель);
	КомандаЗаполнить.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КомандаЗаполнить.Заголовок = "Заполнить";
	КомандаЗаполнить.ИмяКоманды = "ВМК_Заполнить";
КонецПроцедуры
//++

#КонецОбласти

#КонецОбласти