
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ВыполнитьАвтозаполнение(ДоговорАбоненскоеОбслуживание) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДоговорАбоненскоеОбслуживание) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан договор абонентского обслуживания.");
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДоговорАбоненскоеОбслуживание.СуммыАбонентскойПлаты) Тогда
		Товары.Очистить();
		Услуги.Очистить();

		Товар = Товары.Добавить();
		Товар.Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		Товар.Количество = 1;
		Товар.Цена = 0;
		Товар.Сумма = 0;
		
		Если ДоговорАбоненскоеОбслуживание.Свойство("СуммыАбонентскойПлаты") Тогда 
			Товар.Цена = ДоговорАбоненскоеОбслуживание.СуммыАбонентскойПлаты;
			Товар.Сумма = ДоговорАбоненскоеОбслуживание.СуммыАбонентскойПлаты * Товар.Количество;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("В договоре абонентского обслуживания отсутствует реквизит СуммыАбонентскойПлаты.");
			Возврат;
		КонецЕсли;

		Услуга = Услуги.Добавить();
		Услуга.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		Услуга.Количество = 1;
		Услуга.Цена = 0;
		Услуга.Сумма = 0;
		
		Если ДоговорАбоненскоеОбслуживание.Свойство("СтоимостьЧасаРаботы") Тогда 
			Услуга.Цена = ДоговорАбоненскоеОбслуживание.СтоимостьЧасаРаботы;
			Услуга.Сумма = ДоговорАбоненскоеОбслуживание.СтоимостьЧасаРаботы * Услуга.Количество;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("В договоре абонентского обслуживания отсутствует реквизит СтоимостьЧасаРаботы.");
			Возврат;
		КонецЕсли;
		СуммаДокумента = Товар.Сумма + Услуга.Сумма;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Проверьте данные для заполнения.");
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл	
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл	
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Договор = Договор;
		Движение.Клиент = Контрагент;
		Движение.КоличествоЧасов = ТекСтрокаУслуги.Количество;
		Движение.СуммаКОплате = ТекСтрокаУслуги.Сумма;
	КонецЦикла;
	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
