#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ВыполнитьАвтозаполнение() Экспорт

	Если Договор.ВидДоговора.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан договор абонентского обслуживания.");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Договор.ВКМ_СуммыАбонентскойПлаты) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"В договоре абонентского обслуживания отсутствует реквизит СуммыАбонентскойПлаты.");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Договор.ВКМ_СтоимостьЧасаРаботы) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"В договоре абонентского обслуживания отсутствует реквизит СтоимостьЧасаРаботы.");
		Возврат;
	КонецЕсли;
	Товары.Очистить();
	Услуги.Очистить();
	
	КоличествоОстаток = ПолучитьКоличествоЧасовОстаток(Договор, Дата);	
	
	// Услуга – часы работы специалиста
	Услуга = Услуги.Добавить();
	Услуга.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	Услуга.Количество   = КоличествоОстаток;
	Услуга.Цена         = Договор.ВКМ_СтоимостьЧасаРаботы;
	Услуга.Сумма        = Услуга.Цена * Услуга.Количество;
	
	СуммаДокумента = Товары.Итог("Сумма")  + Услуга.Сумма;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКоличествоЧасовОстаток(Договор, Дата)

	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОстатки.КоличествоЧасовОстаток КАК КоличествоЧасовОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Остатки(&Дата, Договор = &Договор
	|	И Клиент = &Клиент) КАК ВКМ_ВыполненныеКлиентуРаботыОстатки
	|ГДЕ
	|	НЕ ВКМ_ВыполненныеКлиентуРаботыОстатки.Клиент.ПометкаУдаления";

	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Клиент", Контрагент);
	Запрос.УстановитьПараметр("Дата", Дата);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		КоличествоЧасовОстаток = Выборка.КоличествоЧасовОстаток;
		Возврат КоличествоЧасовОстаток;
	КонецЦикла;

	ОбщегоНазначения.СообщитьПользователю("Необходимо выбрать договоре абонентского обслуживания");
	Возврат КоличествоЧасовОстаток = 0;

КонецФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ЗаказПокупателя.Организация КАК Организация,
				   |	ЗаказПокупателя.Контрагент КАК Контрагент,
				   |	ЗаказПокупателя.Договор КАК Договор,
				   |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
				   |	ЗаказПокупателя.Товары.(
				   |		Ссылка КАК Ссылка,
				   |		НомерСтроки КАК НомерСтроки,
				   |		Номенклатура КАК Номенклатура,
				   |		Количество КАК Количество,
				   |		Цена КАК Цена,
				   |		Сумма КАК Сумма
				   |	) КАК Товары,
				   |	ЗаказПокупателя.Услуги.(
				   |		Ссылка КАК Ссылка,
				   |		НомерСтроки КАК НомерСтроки,
				   |		Номенклатура КАК Номенклатура,
				   |		Количество КАК Количество,
				   |		Цена КАК Цена,
				   |		Сумма КАК Сумма
				   |	) КАК Услуги
				   |ИЗ
				   |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
				   |ГДЕ
				   |	ЗаказПокупателя.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);

	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;

	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;

	Основание = ДанныеЗаполнения;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;

	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Договор = Договор;
		Движение.Клиент = Контрагент;
		Движение.КоличествоЧасов = ТекСтрокаУслуги.Количество;
		Движение.СуммаКОплате = ТекСтрокаУслуги.Сумма;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли