// @strict-types

&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Элемент <> Неопределено И Элемент.ТекущиеДанные <> Неопределено Тогда
		
	ДатаНачала = НачалоДня(Элемент.ТекущиеДанные.ДатаНачала);
	ДатаОкончания = КонецДня(Элемент.ТекущиеДанные.ДатаОкончания);

	Если (ДатаОкончания - ДатаНачала) / 86400 > 28 Тогда
		Элемент.ТекущиеДанные.Более28 = Истина;
	Иначе
		Элемент.ТекущиеДанные.Более28 = Ложь;
	КонецЕсли;
	
КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)

	ПараметрыОткрытия = Новый Структура("ОтпускаСотрудниковОбъект", Объект.ОтпускаСотрудников);

	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализаГрафиков", ПараметрыОткрытия, ЭтотОбъект);

КонецПроцедуры