#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда	
	#Область СлужебныеПроцедурыМФункции	
	
	Функция СозданиеСпискаНаСервере(Дата, СоздатьОбъект) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_Док
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	&Дата МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	РеализацияТоваровУслуг.Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачало И &ДатаОкончания
		|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Док.Ссылка КАК Договор,
		|	ВТ_Реализация.Ссылка КАК Реализация,
		|	ВТ_Док.Контрагент КАК Контрагент,
		|	ВТ_Док.Организация КАК Организация
		|ИЗ
		|	ВТ_Реализация КАК ВТ_Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Док КАК ВТ_Док
		|		ПО ВТ_Реализация.Договор = ВТ_Док.Ссылка";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ДатаНачало", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Дата));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		МассивРеализаций = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			РеализацияСтруктура = Новый Структура;	
			
			Если СоздатьОбъект Тогда
				
				Если Не ЗначениеЗаполнено(Выборка.Результат) Тогда
					НоваяРеализация = СозданиеРеализации(Выборка, КонецМесяца(Дата));
					РеализацияСтруктура.Вставить("Договор", Выборка.Договор);
					РеализацияСтруктура.Вставить("Реализация", НоваяРеализация);	
				Иначе
					РеализацияСтруктура.Вставить("Договор", Выборка.Договор);
					РеализацияСтруктура.Вставить("Реализация", НоваяРеализация);
				КонецЕсли;
				
			Иначе
				РеализацияСтруктура.Вставить("Договор", Выборка.Договор);
				РеализацияСтруктура.Вставить("Реализация", Выборка.Реализация);		
			КонецЕсли;
			
		КонецЦикла;
		
		МассивРеализаций.Добавить(РеализацияСтруктура);
				
	КонецФункции
	
	Функция СозданиеРеализации(Результат, Дата)
		
		НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДок.Дата = Дата;
		НовыйДок.Договор = Результат.Договор;
		НовыйДок.Контрагент = Результат.Контрагент;
		НовыйДок.Организация = Результат.Организация;
		НовыйДок.ВыполнитьАвтозаполнение();
		НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
		
		Если НовыйДок.ПроверитьЗаполнение() Тогда
			
			Попытка
				НачатьТранзакцию();
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ОбщегоНазначения.СообщитьПользователю("Проведение документа невозможно.");
				ЗаписьЖурналаРегистрации("Обработка: Массовое создание Актов отменено.");		
			КонецПопытки;
			
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			"Не удалось создать документ реализации по Договору: %1. Не все данные заполнены.", Результат.Договор));
		КонецЕсли;
		
		Возврат НовыйДок.Ссылка;
		
	КонецФункции
	
	
	#КонецОбласти	
#КонецЕсли