Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ДополнительныеНачисления
Движения.ДополнительныеНачисления.Записывать = Истина;
Движения.ДополнительныеНачисления.Записать();

Движения.Удержания.Записывать = Истина;
Движения.Удержания.Записать();

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка КАК Ссылка,
	|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.НомерСтроки КАК НомерСтроки,
	|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии КАК СуммаПремии
	|ПОМЕСТИТЬ ВТ_Док
	|ИЗ
	|	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
	|ГДЕ
	|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Док.Ссылка КАК Ссылка,
	|	ВТ_Док.НомерСтроки КАК НомерСтроки,
	|	ВТ_Док.Сотрудник КАК Сотрудник,
	|	ВТ_Док.СуммаПремии КАК СуммаПремии,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот
	|ИЗ
	|	ВТ_Док КАК ВТ_Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(, Сотрудник В
	|			(ВЫБРАТЬ
	|				ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник
	|			ИЗ
	|				Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК
	|					ВКМ_НачислениеФиксированнойПремииСписокСотрудников)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_Док.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";

Запрос.УстановитьПараметр("Ссылка", Ссылка);

Выборка = Запрос.Выполнить().Выбрать();

Пока Выборка.Следующий() Цикл
	
	Движение = Движения.ДополнительныеНачисления.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.Премия;
	Движение.ПериодРегистрации = Дата;
	Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	Движение.ПериодДействияКонец = КонецМесяца(Дата);
	Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
	Движение.БазовыйПериодКонец = КонецМесяца(Дата);
	Движение.Сотрудник = Выборка.Сотрудник;
	Движение.Сумма = Выборка.СуммаПремии;
	Движение.ПроцентОтРабот = Выборка.ПроцентОтРабот; 

Движение = Движения.Удержания.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.Удержания.НДФЛ;
	Движение.ПериодРегистрации = Дата;
	Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	Движение.ПериодДействияКонец = КонецМесяца(Дата);
	Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
	Движение.БазовыйПериодКонец = КонецМесяца(Дата);
	Движение.Сотрудник = Выборка.Сотрудник;
	Движение.Сумма = Выборка.СуммаПремии * 0.13;
	
КонецЦикла;
	
КонецПроцедуры