// @strict-types

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ВКМ_ЗапланированныеОтпуска
	Движения.ВКМ_ЗапланированныеОтпуска.Записывать = Истина;
	Движения.ВКМ_ЗапланированныеОтпуска.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ЗапланированныеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Год = Год;

		Движение.ДнейПлан = (НачалоДня(ВыборкаДетальныеЗаписи.ДатаОкончания) - НачалоДня(
			ВыборкаДетальныеЗаписи.ДатаНачала)) / 86400 + 1;

		Если ВыборкаДетальныеЗаписи.ДатаОкончания < Дата Тогда
			Движение.ДнейФакт = (НачалоДня(ВыборкаДетальныеЗаписи.ДатаОкончания) - НачалоДня(
				ВыборкаДетальныеЗаписи.ДатаНачала)) / 86400 + 1;
		ИначеЕсли ВыборкаДетальныеЗаписи.ДатаНачала > Дата Тогда
			Движение.ДнейФакт = 0;
		Иначе
			Движение.ДнейФакт = (НачалоДня(Дата) - НачалоДня(ВыборкаДетальныеЗаписи.ДатаНачала)) / 86400 + 1;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры