
&НаСервере
Процедура ПриОткрытииНаСервере()
	


КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте                  
Процедура Заполнить(Команда)
   ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните организацию");
		возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Период) тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните период расчета");
		возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	      "ВЫБРАТЬ
	      |	ВКМ_ГрафикиРаботГрафикиПоМесяцам.Ссылка КАК Ссылка,
	      |	ВКМ_ГрафикиРаботГрафикиПоМесяцам.Месяц КАК Месяц,
	      |	ВКМ_ГрафикиРаботГрафикиПоМесяцам.РабочихДней КАК РабочихДней
	      |ПОМЕСТИТЬ Графики
	      |ИЗ
	      |	Справочник.ВКМ_ГрафикиРабот.ГрафикиПоМесяцам КАК ВКМ_ГрафикиРаботГрафикиПоМесяцам
	      |ГДЕ
	      |	ВКМ_ГрафикиРаботГрафикиПоМесяцам.Месяц = &ДатаНачала
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	ВКМ_ФизическиеЛица.Ссылка КАК Ссылка,
	      |	ВКМ_ФизическиеЛица.ТарифнаяСтавка КАК ТарифнаяСтавка,
	      |	ВКМ_ФизическиеЛица.Наименование КАК Наименование,
	      |	ВКМ_ФизическиеЛица.Должность КАК Должность,
	      |	ВКМ_ФизическиеЛица.ВидТарифнойСтавки КАК ВидТарифнойСтавки,
	      |	ВЫБОР
	      |		КОГДА ВКМ_ФизическиеЛица.ДатаПриема <= &ДатаНачала
	      |			ТОГДА &ДатаНачала
	      |		ИНАЧЕ ВКМ_ФизическиеЛица.ДатаПриема
	      |	КОНЕЦ КАК ДатаНачала,
	      |	ВЫБОР
	      |		КОГДА ВКМ_ФизическиеЛица.ДатаУвольнения >= &ДатаОкончания
	      |				ИЛИ ВКМ_ФизическиеЛица.ДатаУвольнения = &ПустаяДата
	      |			ТОГДА &ДатаОкончания
	      |		ИНАЧЕ ВКМ_ФизическиеЛица.ДатаУвольнения
	      |	КОНЕЦ КАК ДатаОкончания,
	      |	Графики.РабочихДней КАК РабочихДней,
	      |	ВКМ_ФизическиеЛица.ГрафикРабот КАК ГрафикРабот
	      |ИЗ
	      |	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
	      |		ЛЕВОЕ СОЕДИНЕНИЕ Графики КАК Графики
	      |		ПО ВКМ_ФизическиеЛица.ГрафикРабот = Графики.Ссылка
	      |ГДЕ
	      |	ВКМ_ФизическиеЛица.ДатаПриема <= &ДатаОкончания
	      |	И (ВКМ_ФизическиеЛица.ДатаУвольнения >= &ДатаНачала
	      |			ИЛИ ВКМ_ФизическиеЛица.ДатаУвольнения = &ПустаяДата)
	      |	И ВКМ_ФизическиеЛица.Организация = &Организация";
	      
	Запрос.УстановитьПараметр("ПустаяДата",Дата('00010101'));
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.Начисления.Очистить();
		
	Для Каждого стр из РезультатЗапроса Цикл
		 НоваяСтрока = Объект.Начисления.Добавить();
		 НоваяСтрока.Сотрудник = стр.Ссылка;
		 НоваяСтрока.Организация = Объект.Организация;
		 НоваяСтрока.ДатаНачала	= стр.ДатаНачала;
		 НоваяСтрока.ДатаОкончания	= стр.ДатаОкончания;
		 НоваяСтрока.ГрафикРаботы =  стр.ГрафикРабот;
		 НоваяСтрока.ДнейПоГрафику = стр.РабочихДней;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Дата = ТекущаяДата();
	Объект.Период = НачалоМесяца(НачалоМесяца(ТекущаяДата())-86400);
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	Для каждого стр из Объект.Начисления Цикл    
		Если ЗначениеЗаполнено(стр.ДнейПоГрафику) и ЗначениеЗаполнено(стр.Дней) тогда
		  	Стр.Результат = Окр(стр.Сотрудник.ТарифнаяСтавка/стр.ДнейПоГрафику*стр.Дней,2); 
			Стр.НДФЛ =  Окр(Стр.Результат*0.13,2);
			стр.КВыплате = Стр.Результат-Стр.НДФЛ;
		иначе 
			ОбщегоНазначения.СообщитьПользователю("Заполните	дни");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры
