Процедура ОбработкаПроведения(Отказ, Режим)

	СформироватьДвижение();
	
	Взаиморасчеты(Отказ);

	РасчитатьОклад();
	
	РасчитатьУдержания();
	
КонецПроцедуры

Процедура СформироватьДвижение()
	
		Движения.ОсновныеНачисления.Записывать 			= Истина;
		Движения.Удержания.Записывать 					= Истина;
		Движения.ДополнительныеНачисления.Записывать 	= Истина;
			
		Движения.ОсновныеНачисления.Очистить();
		Движения.Удержания.Очистить();
		Движения.ДополнительныеНачисления.Очистить();

Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачисленияЗарплатыНачисления.Организация КАК Организация,
		|	ВКМ_НачисленияЗарплатыНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|	ВКМ_НачисленияЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_НачисленияЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
		|	ВКМ_НачисленияЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник В
		|			(ВЫБРАТЬ
		|				ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник
		|			ИЗ
		|				Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
		|			ГДЕ
		|				ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_НачисленияЗарплатыНачисления.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
		// регистр ОсновныеНачисления
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда	
			Движение = Движения.ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета 			= Выборка.ВидРасчета;
			Движение.ПериодРегистрации 		= Дата;
			Движение.ПериодДействияНачало 	= Выборка.ДатаНачала;
			Движение.ПериодДействияКонец 	= Выборка.ДатаОкончания;
			Движение.БазовыйПериодНачало 	= ДобавитьМесяц(НачалоМесяца(Выборка.ДатаНачала), -1);
			Движение.БазовыйПериодКонец 	= ДобавитьМесяц(КонецМесяца(Выборка.ДатаОкончания), 1);
			Движение.Сотрудник 				= Выборка.Сотрудник;
			Движение.Оклад 					= Выборка.Оклад;
			Движение.ПроцентОтРабот 		= Выборка.ПроцентОтРабот;
		КонецЕсли;

		// регистр ДополнительныеНачисления
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ДополнительныеНачисления") Тогда	
			Движение = Движения.ДополнительныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета 			= Выборка.ВидРасчета;
			Движение.ПериодРегистрации 		= Дата;
			Движение.ПериодДействияНачало 	= Выборка.ДатаНачала;
			Движение.ПериодДействияКонец 	= Выборка.ДатаОкончания;
			Движение.Сотрудник 				= Выборка.Сотрудник;
			Движение.Сумма 					= Выборка.Оклад;
			Движение.ПроцентОтРабот 		= Выборка.ПроцентОтРабот;
			Движение.БазовыйПериодНачало 	= ДобавитьМесяц(НачалоМесяца(Выборка.ДатаНачала), -1);
			Движение.БазовыйПериодКонец 	= ДобавитьМесяц(КонецМесяца(Выборка.ДатаОкончания), 1);		
		КонецЕсли;
			
	// регистр Удержания
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.Удержания") Тогда	
			Движение = Движения.Удержания.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета 			= Выборка.ВидРасчета;
			Движение.ПериодРегистрации 		= Дата;
			Движение.ПериодДействияНачало 	= Выборка.ДатаНачала;
			Движение.ПериодДействияКонец 	= Выборка.ДатаОкончания;
			Движение.Сотрудник 				= Выборка.Сотрудник;
			Движение.Сумма 					= Выборка.Оклад;		
		КонецЕсли;

	КонецЦикла;
	
	Движения.ОсновныеНачисления.Записать();	
	Движения.ДополнительныеНачисления.Записать();
	Движения.Удержания.Записать();
	
КонецПроцедуры

Процедура Взаиморасчеты(Отказ)

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_НачисленияЗарплатыНачисления.НомерСтроки КАК НомерСтроки,
	|	ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_НачисленияЗарплатыНачисления.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Док
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
	|ГДЕ
	|	ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_Док.НомерСтроки) КАК НомерСтроки,
	|	ВТ_Док.Сотрудник КАК Сотрудник,
	|	ВТ_Док.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ЕСТЬNULL(ОсновныеНачисления.Оклад, 0) + ЕСТЬNULL(ДополнительныеНачисления.Сумма, 0) -
	|		ЕСТЬNULL(Удержания.Сумма, 0)) КАК СуммаНачислено
	|ИЗ
	|	ВТ_Док КАК ВТ_Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
	|		ПО ВТ_Док.Ссылка = ОсновныеНачисления.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
	|		ПО ВТ_Док.Ссылка = ДополнительныеНачисления.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК Удержания
	|		ПО ВТ_Док.Ссылка = Удержания.Регистратор
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Док.Сотрудник,
	|	ВТ_Док.Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаНачислено;
		Движение.Регистратор = Ссылка;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;

	КонецЦикла;

КонецПроцедуры

Процедура РасчитатьУдержания()


	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисления.Оклад КАК Оклад,
	|	ЕСТЬNULL(УдержанияБазаДополнительныеНачисления.СуммаБаза, 0) КАК ОсновныеНачисленияСуммаБаза,
	|	ЕСТЬNULL(УдержанияБазаОсновныеНачисления.ОкладБаза, 0) КАК ОкладБаза,
	|	ЕСТЬNULL(ОсновныеНачисленияБазаУдержания.СуммаБаза, 0) КАК СуммаБаза,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеНачисленияБазаОсновныеНачисления.ОкладБаза, 0) = 0
	|			ТОГДА ОсновныеНачисления.Оклад
	|		ИНАЧЕ ОсновныеНачисленияБазаОсновныеНачисления.ОкладБаза
	|	КОНЕЦ КАК ОкладБазаОсновныеНачисления,
	|	ЕСТЬNULL(ОсновныеНачисленияБазаОсновныеНачисления.ОкладБаза, 0) КАК БазаОсновныеНачислени
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания.БазаДополнительныеНачисления(&Измерения, &Измерения,,
	|			Регистратор = &Ссылка) КАК УдержанияБазаДополнительныеНачисления
	|		ПО ОсновныеНачисления.НомерСтроки = УдержанияБазаДополнительныеНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания.БазаОсновныеНачисления(&Измерения, &Измерения,, Регистратор = &Ссылка) КАК
	|			УдержанияБазаОсновныеНачисления
	|		ПО ОсновныеНачисления.НомерСтроки = УдержанияБазаОсновныеНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления.БазаУдержания(&Измерения, &Измерения,, Регистратор = &Ссылка) КАК
	|			ОсновныеНачисленияБазаУдержания
	|		ПО ОсновныеНачисления.НомерСтроки = ОсновныеНачисленияБазаУдержания.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления.БазаОсновныеНачисления(&Измерения, &Измерения,,
	|			Регистратор = &Ссылка) КАК ОсновныеНачисленияБазаОсновныеНачисления
	|		ПО ОсновныеНачисления.НомерСтроки = ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки
	|ГДЕ
	|	ОсновныеНачисления.Регистратор = &Ссылка";

	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");

//	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.Удержания.НДФЛ);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Движение = Движения.Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.Удержания.НДФЛ;

		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.ОкладБазаОсновныеНачисления * 0.13;
	КонецЦикла;
	
	Движения.Удержания.Записать();	

КонецПроцедуры

Процедура РасчитатьОклад()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План,
	|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
	|	ОсновныеНачисленияДанныеГрафика.Оклад КАК Оклад
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
	|			ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Оклад)
	|				И Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Движение = Движения.ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Движение.Оклад = Выборка.Оклад * Выборка.Факт;

	КонецЦикла;

	Движения.ОсновныеНачисления.Записать( , Истина);

КонецПроцедуры




