Процедура ОбработкаПроведения(Отказ, Режим)

	СотрудникСведения = СведенияОСотруднике(Ссылка, Дата);

	ОсновныеНачисления(СотрудникСведения);
	ДополнительныеНачисления(СотрудникСведения);

	РасчитатьОклад();

	Удержания(СотрудникСведения);
	
КонецПроцедуры

Функция СведенияОСотруднике(Ссылка, Дата)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты КАК ВКМ_НачисленияЗарплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&Дата,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник
	|					ИЗ
	|						Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
	|					ГДЕ
	|						ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_НачисленияЗарплаты.Начисления.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ВКМ_НачисленияЗарплаты.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Сведение = Новый Структура;

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

	Сведение.Вставить("Оклад", ВыборкаДетальныеЗаписи.Оклад);
	Сведение.Вставить("ПроцентОтРабот", ВыборкаДетальныеЗаписи.ПроцентОтРабот);

КонецЦикла;

	Возврат Сведение;

КонецФункции

Функция ФактическиОтработаноДней()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Факт;
	КонецЕсли;

КонецФункции

Процедура ОсновныеНачисления(СотрудникСведения)
	
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Движения.ОсновныеНачисления.Очистить();

	Если Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ТекСтрокаНачисления Из Начисления Цикл

		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда

			Движение = Движения.ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
			Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
			Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаОкончания;
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Если СотрудникСведения <> Неопределено Тогда
				Движение.Оклад = СотрудникСведения.Оклад;
				Движение.ПроцентОтРабот = СотрудникСведения.ПроцентОтРабот;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Движения.ОсновныеНачисления.Записать();

КонецПроцедуры
Процедура ДополнительныеНачисления(СотрудникСведения)
	
	// регистр ДополнительныеНачисления
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл

		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ДополнительныеНачисления") Тогда
			Движение = Движения.ДополнительныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
			Движение.ПериодРегистрации = ТекСтрокаНачисления.ДатаНачала;
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Движение.Сумма = СотрудникСведения.Оклад;
			Движение.ПроцентОтРабот = СотрудникСведения.ПроцентОтРабот;

		КонецЕсли;

		Движения.ДополнительныеНачисления.Записать();

	КонецЦикла;

КонецПроцедуры

Процедура Удержания(СотрудникСведения)
		
	// регистр Удержания
	Движения.Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл

		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.Удержания") Тогда

			Движение = Движения.Удержания.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
			Движение.ПериодРегистрации = ТекСтрокаНачисления.ДатаНачала;
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Движение.Сумма = СотрудникСведения.Оклад;

		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура РасчитатьОклад()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План,
	|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
	|	ОсновныеНачисленияДанныеГрафика.Оклад КАК Оклад
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
	|			ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Оклад)
	|				И Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Движение = Движения.ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Движение.Оклад = Выборка.Оклад * Выборка.Факт;

	КонецЦикла;

	Движения.ОсновныеНачисления.Записать( , Истина);

КонецПроцедуры