Процедура ОбработкаПроведения(Отказ, Режим) 
	
	СформироватьДвижение();  
	
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл 
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = НачалоМесяца(ТекСтрокаНачисления.ДатаНачала);
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Сумма = ТекСтрокаНачисления.Результат; 

		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = НачалоМесяца(ТекСтрокаНачисления.ДатаНачала);
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Сумма = ТекСтрокаНачисления.НДФЛ; 
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвижение()
	
	Движения.ОсновныеНачисления.Записывать 			= Истина;
	Движения.ДополнительныеНачисления.Записывать 	= Истина;
	Движения.Удержания.Записывать 					= Истина;
		
	Движения.ОсновныеНачисления.Очистить();
	Движения.ДополнительныеНачисления.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачисленияЗарплатыНачисления.Ссылка КАК Ссылка,
		|	ВКМ_НачисленияЗарплатыНачисления.НомерСтроки КАК НомерСтроки,
		|	ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачисленияЗарплатыНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|	ВКМ_НачисленияЗарплатыНачисления.ДнейПоГрафику КАК ДнейПоГрафику,
		|	ВКМ_НачисленияЗарплатыНачисления.Дней КАК Дней,
		|	ВКМ_НачисленияЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_НачисленияЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
		|	ВКМ_НачисленияЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
		|	ВКМ_НачисленияЗарплатыНачисления.Результат КАК Результат,
		|	ВКМ_НачисленияЗарплатыНачисления.НДФЛ КАК НДФЛ,
		|	ВКМ_НачисленияЗарплатыНачисления.КВыплате КАК КВыплате,
		|	ВКМ_НачисленияЗарплатыНачисления.Ссылка.Дата КАК Дата,
		|	ВКМ_НачисленияЗарплатыНачисления.Ссылка.Организация КАК Организация,
		|	ВКМ_НачисленияЗарплатыНачисления.Ссылка.Период КАК Период
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Ввбор = Запрос.Выполнить();
	Выборка = Ввбор.Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
			Движение = Движения.ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета 			= Выборка.ВидРасчета;
			Движение.ПериодРегистрации 		= Выборка.Период;
			Движение.ПериодДействияНачало 	= Выборка.ДатаНачала;
			Движение.ПериодДействияКонец 	= Выборка.ДатаОкончания;
			Движение.БазовыйПериодНачало 	= НачалоМесяца(Выборка.ДатаНачала);
			Движение.БазовыйПериодКонец 	= КонецМесяца(Выборка.ДатаОкончания);
			Движение.Сотрудник 				= Выборка.Сотрудник;
			Движение.Оклад 					= Выборка.Результат;
		Движения.ОсновныеНачисления.Записать();	

		Движение = Движения.Удержания.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета 			= ПланыВидовРасчета.Удержания.НДФЛ;
			Движение.ПериодРегистрации 		= Выборка.Период;
			Движение.ПериодДействияНачало 	= Выборка.ДатаНачала;
			Движение.ПериодДействияКонец 	= Выборка.ДатаОкончания;
			Движение.БазовыйПериодНачало 	= НачалоМесяца(Выборка.ДатаНачала);
			Движение.БазовыйПериодКонец 	= КонецМесяца(Выборка.ДатаОкончания);
			Движение.Сотрудник 				= Выборка.Сотрудник;
			Движение.Сумма					= Выборка.НДФЛ;
	 	Движения.Удержания.Записать();
			
	КонецЦикла;
	
КонецПроцедуры



