Процедура ОбработкаПроведения(Отказ, Режим)

	СотрудникСведения = СведенияОСотруднике(Ссылка, Дата);

	ОсновныеНачисления(СотрудникСведения);

	ДополнительныеНачисления(СотрудникСведения);

	СформироватьДвиженияУдержания(СотрудникСведения);

	РасчитатьОклад();
	РасчитатьУдержания();
	Взаиморасчеты(Отказ);

КонецПроцедуры

Функция СведенияОСотруднике(Ссылка, Дата)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты КАК ВКМ_НачисленияЗарплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&Дата,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник
	|					ИЗ
	|						Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
	|					ГДЕ
	|						ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_НачисленияЗарплаты.Начисления.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ВКМ_НачисленияЗарплаты.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Сведение = Новый Структура;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Сведение.Вставить("Оклад", ВыборкаДетальныеЗаписи.Оклад);
		Сведение.Вставить("ПроцентОтРабот", ВыборкаДетальныеЗаписи.ПроцентОтРабот);

	КонецЦикла;

	Возврат Сведение;

КонецФункции

Функция ФактическиОтработаноДней()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Факт;
	КонецЕсли;

КонецФункции

Процедура ОсновныеНачисления(СотрудникСведения)
	
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Движения.ОсновныеНачисления.Очистить();

	Если Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ТекСтрокаНачисления Из Начисления Цикл

		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда

			Движение = Движения.ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
			Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
			Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаОкончания;
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Если СотрудникСведения <> Неопределено Тогда
				Движение.Оклад = СотрудникСведения.Оклад;
				Движение.ПроцентОтРабот = СотрудникСведения.ПроцентОтРабот;
				Движение.БазовыйПериодНачало = ДобавитьМесяц(НачалоМесяца(ТекСтрокаНачисления.ДатаНачала), -1);
				Движение.БазовыйПериодКонец = ДобавитьМесяц(КонецМесяца(ТекСтрокаНачисления.ДатаОкончания), -1);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Движения.ОсновныеНачисления.Записать();

КонецПроцедуры

// Процедура выполняет заполнение дополнительных начислений
Процедура ДополнительныеНачисления(СотрудникСведения)
	
	// регистр ДополнительныеНачисления
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл

		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ДополнительныеНачисления") Тогда
			Движение = Движения.ДополнительныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
			Движение.ПериодРегистрации = ТекСтрокаНачисления.ДатаНачала;
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Движение.Сумма = СотрудникСведения.Оклад;
			Движение.ПроцентОтРабот = СотрудникСведения.ПроцентОтРабот;
			Движение.БазовыйПериодНачало = ДобавитьМесяц(НачалоМесяца(ТекСтрокаНачисления.ДатаНачала), -1);
			Движение.БазовыйПериодКонец = КонецМесяца(ТекСтрокаНачисления.ДатаОкончания);
		КонецЕсли;

		Движения.ДополнительныеНачисления.Записать();

	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияУдержания(СотрудникСведения)
	
	Движения.Удержания.Записывать = Истина;
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		
		Если ТипЗнч(ТекСтрокаНачисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
			Движение = Движения.Удержания.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
			Движение.ПериодРегистрации = ТекСтрокаНачисления.ДатаНачала;
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Движение.Сумма = СотрудникСведения.Оклад;
		КонецЕсли;
	
	КонецЦикла;
	
	Движения.Удержания.Записать();
	
КонецПроцедуры

Процедура РасчитатьУдержания()

	Движения.Удержания.Записывать = Истина;
	Движения.Удержания.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисления.Оклад КАК Оклад,
	|	ЕСТЬNULL(УдержанияБазаДополнительныеНачисления.СуммаБаза, 0) КАК ОсновныеНачисленияСуммаБаза,
	|	ЕСТЬNULL(УдержанияБазаОсновныеНачисления.ОкладБаза, 0) КАК ОкладБаза
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания.БазаДополнительныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК УдержанияБазаДополнительныеНачисления
	|		ПО ОсновныеНачисления.НомерСтроки = УдержанияБазаДополнительныеНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания.БазаОсновныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК УдержанияБазаОсновныеНачисления
	|		ПО ОсновныеНачисления.НомерСтроки = УдержанияБазаОсновныеНачисления.НомерСтроки
	|ГДЕ
	|	ОсновныеНачисления.Регистратор = &Ссылка";

	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");

	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.Удержания.НДФЛ);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	СтавкаНДФЛ = 13 / 100;

	Пока Выборка.Следующий() Цикл
		Движение = Движения.Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.Удержания.НДФЛ;

		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.ОсновныеНачисленияСуммаБаза * СтавкаНДФЛ;
	КонецЦикла;

	Движения.Удержания.Записать();
	

КонецПроцедуры

Процедура РасчитатьОклад()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План,
	|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
	|	ОсновныеНачисленияДанныеГрафика.Оклад КАК Оклад
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
	|			ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Оклад)
	|				И Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Движение = Движения.ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Движение.Оклад = Выборка.Оклад * Выборка.Факт;

	КонецЦикла;

	Движения.ОсновныеНачисления.Записать( , Истина);

КонецПроцедуры

Процедура Взаиморасчеты(Отказ)

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_НачисленияЗарплатыНачисления.НомерСтроки КАК НомерСтроки,
	|	ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_НачисленияЗарплатыНачисления.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Док
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
	|ГДЕ
	|	ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_Док.НомерСтроки) КАК НомерСтроки,
	|	ВТ_Док.Сотрудник КАК Сотрудник,
	|	ВТ_Док.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ЕСТЬNULL(ОсновныеНачисления.Оклад, 0) + ЕСТЬNULL(ДополнительныеНачисления.Сумма, 0) -
	|		ЕСТЬNULL(Удержания.Сумма, 0)) КАК СуммаНачислено
	|ИЗ
	|	ВТ_Док КАК ВТ_Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
	|		ПО ВТ_Док.Ссылка = ОсновныеНачисления.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
	|		ПО ВТ_Док.Ссылка = ДополнительныеНачисления.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК Удержания
	|		ПО ВТ_Док.Ссылка = Удержания.Регистратор
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Док.Сотрудник,
	|	ВТ_Док.Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаНачислено;
		Движение.Регистратор = Ссылка;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;

	КонецЦикла;

КонецПроцедуры