&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ГруппаВидДоговора = Элементы.Добавить("ГруппаФормыВидДоговора", Тип("ГруппаФормы"));
	ГруппаВидДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВидДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаВидДоговора.ОтображатьЗаголовок = Истина;
	ГруппаВидДоговора.Заголовок = "Данные договора:";
	ГруппаВидДоговора.Видимость = Ложь;

	ДатаНачалаДействия = Элементы.Добавить("ДатаНачалаДействия", Тип("ПолеФормы"), ГруппаВидДоговора);
	ДатаНачалаДействия.Вид = ВидПоляФормы.ПолеВвода;
	ДатаНачалаДействия.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";

	ДатаОкончанияДействия = Элементы.Добавить("ДатаОкончанияДействия", Тип("ПолеФормы"), ГруппаВидДоговора);
	ДатаОкончанияДействия.Вид = ВидПоляФормы.ПолеВвода;
	ДатаОкончанияДействия.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";

	СуммыАбонентскойПлаты = Элементы.Добавить("СуммыАбонентскойПлаты", Тип("ПолеФормы"), ГруппаВидДоговора);
	СуммыАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	СуммыАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммыАбонентскойПлаты";

	СтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаВидДоговора);
	СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";

КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	Если Объект.ВидДоговора = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.ГруппаФормыВидДоговора.Видимость = Истина;
	Иначе
		Элементы.ГруппаФормыВидДоговора.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры