
&НаСервере
Процедура АвтозаполненияПоОстаткамНаСервере()

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";

Запрос.УстановитьПараметр("Период", Объект.Дата);

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

	Объект.Выплаты.Очистить();
	
	НоваяСтрока = Объект.Выплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);

КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура АвтозаполненияПоОстаткам(Команда)
	АвтозаполненияПоОстаткамНаСервере();
КонецПроцедуры
