// @strict-types

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сотрудники = Параметры.ОтпускаСотрудниковОбъект;

	ДиаграммаОтпусов.Очистить();
	
	Для Каждого Стр Из Сотрудники Цикл

		Точка = ДиаграммаОтпусов.УстановитьТочку(Стр.Сотрудник);
		Точка.Текст = Стр.Сотрудник;
		Серия = ДиаграммаОтпусов.УстановитьСерию("Отпуск");
		Серия.Текст = "Отпуск";
		ЗначениеОтп = ДиаграммаОтпусов.ПолучитьЗначение(Точка, Серия);

		Интервал = ЗначениеОтп.Добавить();
		Интервал.Начало = Стр.ДатаНачала;
		Интервал.Конец = Стр.ДатаОкончания;
	
		СтрокаТаб = Объект.ОтпускаСотрудников.Добавить();
		СтрокаТаб.Сотрудник = Стр.Сотрудник;
		СтрокаТаб.ДатаНачала = Стр.ДатаНачала;
		СтрокаТаб.ДатаОкончания = Стр.ДатаОкончания;

	КонецЦикла;

КонецПроцедуры